In [4]:
import pandas as pd

a = pd.Series([11,22,33,44,],index=['a','b','c','d']) #generate pandas series
print(a)

a    11
b    22
c    33
d    44
dtype: int64

In [7]:
d= {"id":101,"name":"Raj","age":21}
print(d)
s2= pd.Series(d) # generating series from a dictionary
s2

{'id': 101, 'name': 'Raj', 'age': 21}

id      101
name    Raj
age      21
dtype: object

In [12]:
d1={
    "names":["lightangel","bimbok","shadowblue","bongaon"],
    "phys":[89,84,77,99],
    "chem":[89,84,77,99],
    "math":[89,84,77,99]
}

s3=pd.Series(d1)
s3
df= pd.DataFrame(d1) #creating data frame
df

        names  phys  chem  math
0  lightangel    89    89    89
1      bimbok    84    84    84
2  shadowblue    77    77    77
3     bongaon    99    99    99

In [19]:
df=pd.read_csv('./dataset/Income_data.csv') #read a csv file
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952.0,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,NaN,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657.0,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057.0,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319.0,55734,57014,56134,54283,53367,57020,57528

In [20]:
df2 = df.set_index("State")
df2

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952.0,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,NaN,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657.0,47215,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057.0,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319.0,55734,57014,56134,54283,53367,57020,57528

In [23]:
#df.loc[row_labels, column_labels]
#df.iloc[row_selection, column_selection]

df3= df2.loc["Alabama":"Arizona","2005":"2007"]
print(df3)
df4= df2.iloc[0:3,1:4]
df4

          2005     2006   2007
State
Alabama  37150  37952.0  42212
Alaska   55891      NaN  62993
Arizona  45245  46657.0  47215

          2005     2006   2007
State
Alabama  37150  37952.0  42212
Alaska   55891      NaN  62993
Arizona  45245  46657.0  47215

In [27]:
df3= df2["Alabama":"Arizona"]

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952.0,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,NaN,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657.0,47215,46914,45739,46896,48621,47044,50602

In [28]:
df7= df2.loc[["Alabama","Arizona"],["2005","2007","2009"]]
df7

          2005   2007   2009
State
Alabama  37150  42212  39980
Arizona  45245  47215  45739